In [2]:
import pandas as pd

### Exo 3

In [5]:
data3 = pd.Series(['Python' , 'Djnago' , 'Tkinter' , 'PyQt' , 'numpy'])

In [7]:
data3

0     Python
1     Djnago
2    Tkinter
3       PyQt
4      numpy
dtype: object

In [17]:
len(data3)

5

In [21]:
data3 = data3.drop(data3.shape[0]-1)

In [23]:
data3

0     Python
1     Djnago
2    Tkinter
3       PyQt
dtype: object

### Exo4

In [40]:
# supprimer les éléments d'index paires
data4 = pd.Series(['Python' , 'Djnago' , 'Tkinter' , 'PyQt' , 'numpy'])
n = data4.shape[0]
n_droped = 0
for i in range(n):
    if not i%2:
        data4 = data4.drop(i)
        n_droped+=1

data4

1    Djnago
3      PyQt
dtype: object

### Exo6

In [43]:
# liste des données
data = [['Tomas' , 'tomas@gmail.com' , 'Math'], 
        ['Albert' ,'albert@gmail.com' , 'SVT' ],
        ['Nathalie', 'nathalie@gmail.com' , 'Sc Eco'], 
        ['Roberto' ,'roberto@gmail.com' , 'Physique'],
        ['Adam' , 'adam@gmail.com' , 'Info']]
labels = [11 , 12, 13 , 14, 15]
 
# création du DataFrame
df = pd.DataFrame(data , index=labels , columns=[ 'Name' , 'Email' , 'Section'])

In [45]:
df

        Name               Email   Section
11     Tomas     tomas@gmail.com      Math
12    Albert    albert@gmail.com       SVT
13  Nathalie  nathalie@gmail.com    Sc Eco
14   Roberto   roberto@gmail.com  Physique
15      Adam      adam@gmail.com      Info

In [47]:
df1 = df.drop('Section', axis=1)
df1['Age'] = [22, 23, 21, 20, 25]
df1

        Name               Email  Age
11     Tomas     tomas@gmail.com   22
12    Albert    albert@gmail.com   23
13  Nathalie  nathalie@gmail.com   21
14   Roberto   roberto@gmail.com   20
15      Adam      adam@gmail.com   25

### Exo7

In [54]:
email = df['Email'].to_list()

In [56]:
email

['tomas@gmail.com',
 'albert@gmail.com',
 'nathalie@gmail.com',
 'roberto@gmail.com',
 'adam@gmail.com']

### Exo8

In [59]:
dictData = {'ID' : [31, 71, 30 , 11 , 23] , 
            'Nom': ['Julia', 'Tiago', 'Charlie' , 'Alba' , 'Isaac'],  
        'Age': [22, 21, 20, 20 , 23], 
        'Taille': [170, 190, 181 , 175 , 165]}
# création du dataframe
df = pd.DataFrame(dictData , index=[235 , 155 , 243 , 311 , 117])

In [61]:
df

     ID      Nom  Age  Taille
235  31    Julia   22     170
155  71    Tiago   21     190
243  30  Charlie   20     181
311  11     Alba   20     175
117  23    Isaac   23     165

In [63]:
df[['Nom', 'Age']]

         Nom  Age
235    Julia   22
155    Tiago   21
243  Charlie   20
311     Alba   20
117    Isaac   23

### Exo9

In [68]:
df[['Nom', 'Age']].sort_values('Age', ascending=False)

         Nom  Age
117    Isaac   23
235    Julia   22
155    Tiago   21
243  Charlie   20
311     Alba   20

### Exo10

In [71]:
import numpy as np

data = np.array (['P', 'y', 't', 'h', 'o' , 'n'])
s = pd.Series(data , index=[12 , 7 , 13 , 22 , 11 , 2])

In [73]:
s.index

Index([12, 7, 13, 22, 11, 2], dtype='int64')

### Exo11

In [78]:
data = np.array ([43 , -25 , 79  ,  37 , -22  , 34 ])
s = pd.Series(data)

In [80]:
s[s < 0] = 0

In [82]:
s

0    43
1     0
2    79
3    37
4     0
5    34
dtype: int64

### Exo12

In [85]:
data = np.array([430 , -255 , 179  ,  237 , -202  , 304 ] )
s = pd.Series(data , index= [11 , 21 , 17 , 13  , 27  , 14])

In [87]:
s

11    430
21   -255
17    179
13    237
27   -202
14    304
dtype: int64

In [89]:
s[s < 0] = 0

In [91]:
s

11    430
21      0
17    179
13    237
27      0
14    304
dtype: int64

### Exo13

In [96]:
s = pd.Series(["Louis" , "Maya" , "Yassmine"  ,  "Rosa" , "Tomas"] , 
              index= [17 , 21 , 19 , 13  , 27 ])

In [98]:
s.to_dict()

{17: 'Louis', 21: 'Maya', 19: 'Yassmine', 13: 'Rosa', 27: 'Tomas'}

### Exo14

In [103]:
s = pd.Series(["Emma" , "Alice" , "Paul"  ,  "Tiago" , "Julia"] , 
              index= [17 , 21 , 19 , 13  , 27 ])

In [105]:
s.append(pd.Series(["Clara"], index=[11]))

AttributeError: 'Series' object has no attribute 'append'

### Exo15

In [110]:
s = pd.Series(["Maria" , "Amelia" , "Bernard"  ,  "Jules" , "Nathan" , "Enzo"] , 
              index= [17 , 26 , 19 , 12  , 27 , 48 ])

In [114]:
[n for n in s.index if n%2]

[17, 19, 27]

In [116]:
s.loc[[n for n in s.index if n%2]]

17      Maria
19    Bernard
27     Nathan
dtype: object

### Exo17

In [119]:
serie = pd.Series(['a', 'b', 'c', 'd', 'e' , 'f'] , index=[10 , 11 , 23 , 17 , 14 , 15])

In [121]:
serie.loc[max(serie.index)]

'c'

### Exo19

In [125]:
serie1 = pd.Series(['a', 'b', 'c', 'd', 'e' , 'f'] , index=[10 , 12 , 14 , 16 , 18 , 20])
serie2 = pd.Series(['x', 'y', 'z', 't', 'u' , 'v'] , index=[11 , 13 , 15 , 17 , 19 , 21])